code/DataProcessors/Регистрация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>Регистрация</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

code/Catalogs/Сотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сотрудник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code/DataProcessors/Регистрация/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РегистрацияНаСервере() 
	Результат = Число1 + Число2;
	Если ПустаяСтрока(ФИО) или ПустаяСтрока(Должность) или ПустаяСтрока(Логин) или ПустаяСтрока(Пароль) тогда		
		Сообщить("Заполните все данные!");
	ИначеЕсли СтрДлина(Пароль) < 6 тогда      		
		Сообщить("Пароль должен быть не менее 6 символов!");
	ИначеЕсли Пароль <> ПовторитеПароль тогда 
		Сообщить("Пароли не совпадают!");   
	ИначеЕсли
		Сумма<>Результат тогда
		Сообщить ("пример решен НЕПРАВИЛЬНО!");
	Иначе     
		НовыйСотрудник = Справочники.Сотрудник.СоздатьЭлемент();
		НовыйСотрудник.Наименование = ФИО;
		ФИОСотрудника = СтрРазделить(ФИО, " ", Ложь);   
    Если ФИОСотрудника.Количество() >= 1 Тогда
        НовыйСотрудник.Фамилия = ФИОСотрудника[0];
    КонецЕсли;  
    Если ФИОСотрудника.Количество() >= 2 Тогда
        НовыйСотрудник.Имя = ФИОСотрудника[1];
    КонецЕсли;   
    Если ФИОСотрудника.Количество() >= 3 Тогда
        НовыйСотрудник.Отчество = ФИОСотрудника[2];
	КонецЕсли;
		НовыйСотрудник.Должность = Должность;
		НовыйСотрудник.Логин = Логин;
		НовыйСотрудник.Пароль = Пароль;
		НовыйСотрудник.НомерТелефона = Телефон;
		НовыйСотрудник.Email = Email;
		НовыйСотрудник.Записать();
		Сообщить("Регистрация прошла успешно!"); 
		
    Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = Логин;     
	Пользователь.ПолноеИмя = ФИО;
	Пользователь.ПоказыватьВСпискеВыбора = Истина; 
	ВыбраннаяДолжность = Должность.ПолноеНаименование();
	 Если ВыбраннаяДолжность = "Администратор" Тогда
        Пользователь.Роли.Добавить(Метаданные.Роли.Администратор);
    ИначеЕсли ВыбраннаяДолжность = "Менеджер" Тогда
        Пользователь.Роли.Добавить(Метаданные.Роли.Менеджер);
    ИначеЕсли ВыбраннаяДолжность = "Кассир" Тогда
        Пользователь.Роли.Добавить(Метаданные.Роли.Кассир);
    ИначеЕсли ВыбраннаяДолжность = "Агент" Тогда
        Пользователь.Роли.Добавить(Метаданные.Роли.Агент);
    КонецЕсли;
	Пользователь.Записать();
	Сообщить("Пользователь добавлен в систему!");   
	
	ФИО = Неопределено;
	Должность = Неопределено;
	Логин = Неопределено;
	Пароль = Неопределено;
	Email = Неопределено;   
	ПовторитеПароль = Неопределено;  
	Сумма = Неопределено;  
	Телефон =  Неопределено;  
КонецЕсли;  

КонецПроцедуры   
	
	&НаКлиенте
Процедура Регистрация(Команда)
	РегистрацияНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ранд = Новый генераторСлучайныхЧисел();
	чис1 = ранд.СлучайноеЧисло(0,9);
	чис2 = ранд.СлучайноеЧисло(0,9);   
	Число1 = чис1;
	Число2 = чис2;
	Сумма = " ";
КонецПроцедуры


&НаСервере
Процедура ЛогинПриИзмененииНаСервере() 
	// Вставить содержимое обработчика. 
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудник.Логин КАК Логин
		|ИЗ
		|	Справочник.Сотрудник КАК Сотрудник
		|ГДЕ
		|	Сотрудник.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() = Ложь Тогда
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи   
		Сообщить("Такой логин уже существует!");
	КонецЦикла;  
	Логин = "";
	Отказ = Истина;  
	КонецЕсли;

	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры


&НаКлиенте
Процедура ЛогинПриИзменении(Элемент)
	ЛогинПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
